Tekla Open API Reference for Tekla Structures 2025
ModelObjectVisualization.UnhideParts Method
 Unide all parts in the model.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static void UnhideParts()
Public Shared Sub UnhideParts
See Also
Reference
ModelObjectVisualization Class
Tekla.Structures.Model.UI Namespace